src/InformationRegisters/PriceList.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<InformationRegister>
		<Properties>
			<Name>PriceList</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Product</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Products</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonForms/UpdatePriceList/Ext/Form/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	Product = Parameters.SelectedProduct;
	Vendor = Parameters.Vendor;
	VendorCurrency = GeneralFunctions.GetAttributeValue(Vendor, "DefaultCurrency");
	Customer = Parameters.Customer;
	CustomerCurrency = GeneralFunctions.GetAttributeValue(Customer, "DefaultCurrency"); 
	Date = Parameters.Date;
	ExchangeRate = GeneralFunctions.GetExchangeRate(Date, VendorCurrency, CustomerCurrency);
	ProductCost = Parameters.ProductCost;
	Cost = ProductCost / ExchangeRate;
	NewPrice = Cost;
	
	Items.ExchangeRate.Title = String(VendorCurrency.Symbol) + "/" + String(CustomerCurrency.Symbol);
	
EndProcedure

&AtClient
Procedure MarkUpOnChange(Item)
	
	NewPrice = Cost * (1 + MarkUp/100);
	
EndProcedure

&AtClient
Procedure Update(Command)
	
	Close(UpdatePriceList(Product, NewPrice, Date, CustomerCurrency));
	
EndProcedure

&AtServer
Function UpdatePriceList(Product, NewPrice, Date, Currency)
	
	Reg = InformationRegisters.PriceList.CreateRecordManager();
	Reg.Product = Product;
	Reg.Period = Date;
	Reg.Price = NewPrice;
	If GetFunctionalOption("AdvancedPricing") Then
		Reg.Company = Customer;
		Reg.Currency = Currency;
	Else
	EndIf;
	Reg.Write(True);
	
EndFunction

&AtClient
Procedure Cancel(Command)
	
	Close();
	
EndProcedure
